## .pivot_table() Method

create a spreadsheet-style pivot table (Supports data aggregation) Similar to MS Excel pivot tables

In [7]:
import pandas as pd
print(pd.__version__)

2.3.3

In [2]:
df_sales = pd.read_excel('supermarket_sales.xlsx')

In [4]:
df_sales.head()

,Invoice ID,Branch,City,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,cogs,gross margin percentage,gross income,Rating
0,750-67-8428,A,Yangon,Member,Female,Health and beauty,74.69,7,26.1415,548.9715,2019-01-05,13:08:00,Ewallet,522.83,4.761905,26.1415,9.1
1,226-31-3081,C,Naypyitaw,Normal,Female,Electronic accessories,15.28,5,3.8200,80.2200,2019-03-08,10:29:00,Cash,76.40,4.761905,3.8200,9.6
2,631-41-3108,A,Yangon,Normal,Male,Home and lifestyle,46.33,7,16.2155,340.5255,2019-03-03,13:23:00,Credit card,324.31,4.761905,16.2155,7.4
3,123-19-1176,A,Yangon,Member,Male,Health and beauty,58.22,8,23.2880,489.0480,2019-01-27,20:33:00,Ewallet,465.76,4.761905,23.2880,8.4
4,373-73-7910,A,Yangon,Normal,Male,Sports and travel,86.31,7,30.2085,634.3785,2019-02-08,10:37:00,Ewallet,604.17,4.761905,30.2085,5.3

In [9]:
df_sales.select_dtypes(include='number').pivot_table(index=df_sales['Gender'],
                     aggfunc='sum',).round(1)

,Quantity,Rating,Tax 5%,Total,Unit price,cogs,gross income,gross margin percentage
Gender,,,,,,,,
Female,2869,3489.2,7994.4,167882.9,27687.2,159888.5,7994.4,2385.7
Male,2641,3483.5,7384.9,155083.8,27984.9,147698.9,7384.9,2376.2

In [6]:
# make a pivot table add an aggfunc and select some cols
df_sales.pivot_table(index='Gender',
                values=['Total','Quantity'],
                aggfunc='sum')

        Quantity       Total
Gender
Female      2869  167882.925
Male        2641  155083.824

In [10]:
# make a pivot table, that displays how much males and females spent in each category
df_sales.pivot_table(
                index='Gender',
                columns='Product line',
                values='Total',
                aggfunc='sum'
)

Product line,Electronic accessories,Fashion accessories,Food and beverages,Health and beauty,Home and lifestyle,Sports and travel
Gender,,,,,,
Female,27102.0225,30437.400,33170.9175,18560.9865,30036.8775,28574.7210
Male,27235.5090,23868.495,22973.9265,30632.7525,23825.0355,26548.1055